<center>
    <h1>
        <b>
            Chapter 3. Data Wrangling
        </b>
    </h1>
</center>

----

### **3.0 Introduction**

In [1]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load dataset
dataframe = pd.read_csv(url)

#View first two rows
dataframe.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

----

### **3.1 Creating a Data Frame**

**Problem**
- You want to create a new data frame

**Solution**
- Create an empty data frame using `DataFrame` and then define each column separately.

In [2]:
# Load library
import pandas as pd

#Create DataFrame
dataframe = pd.DataFrame()

#Add columns
dataframe['Name'] = ['Jacky Jackson', 'Steven Stevenson']
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]

#Show DataFrame
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [5]:
#Create row
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name', 'Age', 'Driver'])

#Append row
dataframe.append(new_person, ignore_index=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_13724\2650206427.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

----

### **3.2 Describing the Data**

**Problem**
- You want to view some characteristics of a DataFrame

**Solution**
- One of the easiest things we can do after loading the data is view the frist few rows using `head`

In [6]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Show two rows
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [7]:
#Show dimensions
dataframe.shape

(891, 12)

In [8]:
#Show statistics
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

----

### **3.3 Navigating DataFrames**

**Problem**
- You need to select individual data or slices of a DataFrame

**Solution**
- Use `loc` or `iloc` to select one or more rows or values

In [9]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Select first row
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [10]:
#Select three rows
dataframe.iloc[1:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

----

### **3.4 Selecting Rows Based on Conditionals**

**Problem**
- You want to select DataFrame rows based on some condition

**Solution**
- This can be easily done in pandas. For example, if we wanted to select all the women on the *Titanic*

In [12]:
# Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Show top rows where colum 'sex' is 'female'
dataframe[dataframe['Sex'] == 'female'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
#Filter rows 
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 60)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

----

### **3.5 Replacing Values**

**Problem**
- You need to replace values in a DataFrame

**Solution**
- pandas `replace` is an easy way to find and replace values. For example, we can replace any instance of `"female"` in the `Sex` column with `"Woman"`

In [16]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Replace values, show two rows
dataframe['Sex'].replace("female", "Woman").head(2)

0     male
1    Woman
Name: Sex, dtype: object

In [17]:
#Replace "female" and "male" with "Woman" and "Man"
dataframe['Sex'].replace(['female', 'male'], ['Woman', 'Man']).head(5)

0      Man
1    Woman
2    Woman
3    Woman
4      Man
Name: Sex, dtype: object

In [18]:
#replace values, show two rows
dataframe.replace(1, 'One').head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,One,0,3,"Braund, Mr. Owen Harris",male,22.0,One,0,A/5 21171,7.2500,NaN,S
1,2,One,One,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,One,0,PC 17599,71.2833,C85,C

----

### **3.6 Renaming Columns**

**Problem**
- You want to rename a column in a pandas DataFrame

**Solution**
- Rename columns using the `rename` method

In [21]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Rename column, show two rows
dataframe.rename(columns={
    'Pclass': 'Passenger Class'
}).head(2)

,PassengerId,Survived,Passenger Class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [22]:
#Rename colum, show two rows
dataframe.rename(columns={
    'Pclass': 'Passenger Class',
    'Sex': 'Gender'
}).head(2)

,PassengerId,Survived,Passenger Class,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [23]:
#Load library
import collections

#Create dictionary
column_names = collections.defaultdict(str)

#Create keys
for name in dataframe.columns:
    column_names[name]
    
#Show dictionary
column_names

defaultdict(str,
            {'PassengerId': '',
             'Survived': '',
             'Pclass': '',
             'Name': '',
             'Sex': '',
             'Age': '',
             'SibSp': '',
             'Parch': '',
             'Ticket': '',
             'Fare': '',
             'Cabin': '',
             'Embarked': ''})

----

### **3.7 Finding the Minimum, Maximum, Sum, Average and Count**

**Problem**
- You want to find the min, max, sum and average or count of a numeric column.

**Solution**
- pandas comes with some built-in methods for commonly used descriptive statistics

In [24]:
#load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Calculate statistics
print('Maximum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

Maximum: 80.0
Minimum: 0.42
Mean: 29.69911764705882
Sum: 21205.17
Count: 714

----

### **3.8 Finding Unique Values**

**Problem**
- You want to select all unique values in a column

**Solution**
- Use `unique` to view an array of all unique values in a column

In [1]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Select unique values
dataframe['Sex'].unique()

array(['male', 'female'], dtype=object)

Alterantively, `value_counts` will display all unique values with the number of times each value appears

In [2]:
#Show counts
dataframe['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

----

### **3.9 Handling Missing Values**

**Problem**
- You want to select missing values in a DataFrame

**Solution**
- `isnull` and `notnull` return booleans indicating whether a value is missing

In [3]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Select missing values, show two rows
dataframe[dataframe['Age'].isnull()].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S

In [4]:
#Load library
import numpy as np

#Load data, set missing values
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

----

### **3.10 Deleting a Column**

**Problem**
- You want to delete a column from your DataFrame

**Solution**
- The best way to delete a column is to use `drop` with the parameter `axis=1`(i.e, the column axis)

In [6]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Delete column
dataframe.drop('Age', axis=1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C

In [7]:
#Drop columns
dataframe.drop(['Age', 'Sex'], axis=1).head(2)

,PassengerId,Survived,Pclass,Name,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0,PC 17599,71.2833,C85,C

----

### **3.11 Deleting a Row**

**Problem**
- You want to delete one or more rows from a DataFrame

**Solution**
- Use a boolean condition to create a new DataFrame excluding the rows you want to delete.

In [8]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Delete rows, show first two rows of output
dataframe[dataframe['Sex'] != 'male'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

----

### **3.12 Dropping Duplicate Rows**

**Problem**
- You want to drop duplicate rows from your DataFrame

**Solution**
- Use `drop_duplicates`, but be mindful of the parameters

In [1]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Drop duplicates, show first two rows of output
dataframe.drop_duplicates().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
#Drop duplicates 
dataframe.drop_duplicates(subset=['Sex'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [4]:
dataframe.drop_duplicates(subset=['Sex'], keep='last')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

----

### **3.13 Grouping Rows by Values**

**Problem**
- You want to group individual rows according to some shared value

**Solution**
- `groupby` is one of the most powerful features in pandas

In [5]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Group rows by the values of the column 'Sex', calculate mean
#of each group
dataframe.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [8]:
#Group rows, count rows
dataframe.groupby('Survived')['Name'].count()

Survived
0    549
1    342
Name: Name, dtype: int64

In [9]:
#Group rows, calculate mean
dataframe.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64

----

### **3.14 Groping Rows by Time**

**Problem**
- You need to group individual rows by time periods

**Solution**
- Use `resample` to group rows by chunks of time

In [13]:
#Load library
import pandas as pd
import numpy as np

#Create data range 
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

#Create DataFrame
dataframe = pd.DataFrame(index=time_index)

#Create column of random values
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)

#Group rows by week, calculate sum per week
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86236
2017-06-18       101181
2017-06-25       100285
2017-07-02       100122
2017-07-09       100712
2017-07-16        10596

----

### **3.15 Looping Over a Column**

**Problem**
- You want to iterate over every element in a column and apply some action

**Solution**
- You can treat a pandas column like any other sequence in Python

In [14]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Print first two names uppercased
for name in dataframe['Name'][0:2]:
    print(name.upper())

BRAUND, MR. OWEN HARRIS
CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)

----

### **3.16 Applying a Function Over All Elements in a Column**

**Problem**
- You want to apply some function over all elements in a column

**Solution**
- Use `apply` to apply a built-in or custom function on every element in a column

In [15]:
#Load library
import pandas as pd

#Create URL
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Create function
def uppercase(x):
    return x.upper()

#Apply fuction, show two rows
dataframe['Name'].apply(uppercase)[0:2]

0                              BRAUND, MR. OWEN HARRIS
1    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
Name: Name, dtype: object

----

### **3.17 Apply a Function to Groups**

**Problem**
- You have grouped rows using `groupby` and want to apply a function to each group

**Solution**
- Combime `groupby` and `apply`

In [16]:
#Load library
import pandas as pd

#Create URL 
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

#Load data
dataframe = pd.read_csv(url)

#Group rows, apply function to groups
dataframe.groupby('Sex').apply(lambda x: x.count())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,,
female,314,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,577,453,577,577,577,577,107,577

----

### **3.18 Concatenating DataFrames**

**Problem**
- You want to concatenate two DataFrames

**Solution**
Use `concat` with `axis=0` to concatenate along the row axis

In [19]:
#Load library
import pandas as pd

#Ceate DataFrame
data_a = {
    'id': ['1', '2', '3'],
    'first': ['Alex', 'Amy', 'Allen'],
    'last': ['Anderson', 'Ackerman', 'Ali']
}

dataframe_a = pd.DataFrame(data_a, columns=['id', 'first', 'last'])

data_b = {
    'id': ['4', '5', '6'],
    'first': ['Billy', 'Brian', 'Bran'],
    'last': ['Bonder', 'Black', 'Balwner']
}

dataframe_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

#Concatenate DataFrames by rows
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [21]:
#Concatenate DataFrames by rows with axis=1
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

----

### **3.19 Merging DataFrames**

**Problem**
- You want to merge two DataFrames

**Solution**
- To inner join, use `merge` with the `on` parameter to specify the column to merge on:

In [23]:
#Laod library
import pandas as pd

#Cerate DataFrame
employee_data = {
    'employee_id': ['1', '2', '3', '4'],
    'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']
}
dataframe_employees = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

#Create DataFrame
sales_data = {
    'employee_id': ['3', '4', '5', '6'],
    'total_sales': [23456, 2314, 3213, 1442]
}
dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

#Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2314

In [24]:
#Merge DataFrames outer join
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2314.0
4           5         NaN       3213.0
5           6         NaN       1442.0

----